[{"Id":"12X41","BrandId":1,"BrandName":"Logitech","Timer":"AAAAAAAAhas=","ProductName":"MX Master 3","GraphicName":"Logitech MX Master 3.png","CostPrice":50.0000,"MSRP":509.9900,"QtyOnHand":1,"QtyOnBackOrder":0,"Description":"Precision pointing and customized app profiles make the Logitech MX Master 3 bluetooth mouse ideal for engineering and technical use, or any application that requires exacting control. Its Darkfield 4000 DPI sensor pin-points your cursor and works on nearly any surface, even glass. Plus 7 programmable buttons do whatever you need them to."},{"Id":"12X42","BrandId":1,"BrandName":"Logitech","Timer":"AAAAAAAAhaw=","ProductName":"G502","GraphicName":"Logitech G502.png","CostPrice":50.9900,"MSRP":599.9900,"QtyOnHand":1,"QtyOnBackOrder":0,"Description":"Enhance your gaming capabilities with this Logitech G502 HERO optical mouse. It features an advanced HERO optical sensor for extremely precise tracking of up to 16,000 DPI. Eleven programmable buttons offer more options for customized control, and the adjustable weights let you personalize the weight for optimal handling."},{"Id":"12X43","BrandId":1,"BrandName":"Logitech","Timer":"AAAAAAAAha0=","ProductName":"G903","GraphicName":"Logitech G903.png","CostPrice":65.9900,"MSRP":79.9900,"QtyOnHand":9,"QtyOnBackOrder":0,"Description":"Aim for glory with this Logitech G903 LIGHTSPEED wireless gaming mouse. Made to complement your gaming prowess, the G903s formidable PMW3366 optical sensor delivers outstanding tracking accuracy and consistent responsiveness at any speed. Its also fully customizable, with a configurable button layout and programmable RGB lighting effects."},{"Id":"12X44","BrandId":1,"BrandName":"Logitech","Timer":"AAAAAAAAha4=","ProductName":"G600","GraphicName":"Logitech G600.png","CostPrice":25.9900,"MSRP":49.9900,"QtyOnHand":0,"QtyOnBackOrder":5,"Description":"With 20 buttons, the Logitech G600 MMO Gaming Mouse is the most customizable and easy-to-use mouse specifically designed for mastering your favorite MMOs. Get instant access to a full spell bar using just your thumb. Double the number of actions you can perform with any button. Raid all night long with the comfortable, supportive shape. Make the mouse work exactly the way you want it to. Youre in control."},{"Id":"12X45","BrandId":1,"BrandName":"Logitech","Timer":"AAAAAAAAha8=","ProductName":"G305","GraphicName":"Logitech G305.png","CostPrice":29.9900,"MSRP":69.9900,"QtyOnHand":2,"QtyOnBackOrder":3,"Description":"Defeat your enemies with ease when you play with the Logitech G305 optical gaming mouse. The G305 is loaded with HERO sensor 12,000 DPI performance and LIGHTSPEED wireless 1 ms connectivity. Enjoy a lag-free gaming experience and competition-level performance."},{"Id":"22X41","BrandId":2,"BrandName":"Razor","Timer":"AAAAAAAAhbA=","ProductName":"Naga Trinity","GraphicName":"Razor Naga Trinity.png","CostPrice":50.0000,"MSRP":99.9900,"QtyOnHand":4,"QtyOnBackOrder":2,"Description":"Customize your gaming experience to stay ahead of the competition with the Razer Naga Trinity optical gaming mouse. Powered by Razer Chroma, this gaming mouse is designed to give you the edge in MOBA\/MMO gameplay, and you can configure it for everything from weapons to build customisations."},{"Id":"22X42","BrandId":2,"BrandName":"Razor","Timer":"AAAAAAAAhbE=","ProductName":"DeathAdder","GraphicName":"Razor DeathAdder.png","CostPrice":19.9900,"MSRP":59.9900,"QtyOnHand":3,"QtyOnBackOrder":9,"Description":"Unparalleled precision, accuracy, and speed are whats in store when you hit the battlefield with this Razer DeathAdder Elite gaming mouse. It features an eSports-grade optical sensor with 16,000dpi, 450 IPS, and a resolution accuracy of 99.4%. Mechanical mouse switches deliver rapid response times. Add it all up, and youre a step ahead of the rest."},{"Id":"22X43","BrandId":2,"BrandName":"Razor","Timer":"AAAAAAAAhbI=","ProductName":"Basilisk","GraphicName":"Razor Basilisk.png","CostPrice":37.9900,"MSRP":79.9900,"QtyOnHand":7,"QtyOnBackOrder":3,"Description":"Dominate with the Razer Basilisk X HyperSpeed wireless optical gaming mouse. HyperSpeed wireless technology provides a consistent high-speed connection with minimum click latency, and the 16,000 DPI sensor allows accurate and quick movement for competitive gamers. Its 250 hours of battery life means you can put your mind at ease and focus on your game."},{"Id":"22X44","BrandId":2,"BrandName":"Razor","Timer":"AAAAAAAAhbM=","ProductName":"Mamba","GraphicName":"Razor Mamba.png","CostPrice":42.9900,"MSRP":74.9900,"QtyOnHand":40,"QtyOnBackOrder":0,"Description":"Untether your gaming performance with the Razer Mamba Wireless. Featuring all the superior technology youve come to expect from Razers Mamba mice in a wireless form, this mouse removes the fuss of tangling cables and cords, so you get down to business."},{"Id":"22X45","BrandId":2,"BrandName":"Razor","Timer":"AAAAAAAAhbQ=","ProductName":"Viper","GraphicName":"Razor Viper.png","CostPrice":129.9900,"MSRP":199.9900,"QtyOnHand":0,"QtyOnBackOrder":1,"Description":"Experience the pinnacle of gaming mice with the Razer Viper Ultimate mouse. This gaming mouse has a whopping 20,000 maximum DPI sensor and infrared optical mouse switches to track every movement and click. Its ergonomic design and lightweight construction fit effortlessly in your hand for comfort during non-stop gaming marathons."},{"Id":"32X41","BrandId":3,"BrandName":"Asus","Timer":"AAAAAAAAhbU=","ProductName":"ROG Gladius II","GraphicName":"Asus ROG Gladius II.png","CostPrice":49.9900,"MSRP":99.9900,"QtyOnHand":2,"QtyOnBackOrder":3,"Description":"Use precision and speed to take down your toughest opponents with the ASUS ROG Gladius II optical gaming mouse. Equipped with a 16000DPI sensor, 50G acceleration, 400IPS tracking speed, and a 1,000hz polling rate, this mouse has the power you need to annihilate the competition. With Bluetooth connectivity, youll enjoy complete freedom from cumbersome cords."},{"Id":"32X42","BrandId":3,"BrandName":"Asus","Timer":"AAAAAAAAhbY=","ProductName":"Strix Evolve","GraphicName":"Asus ROG Strix Evolve.png","CostPrice":39.9900,"MSRP":79.9900,"QtyOnHand":5,"QtyOnBackOrder":2,"Description":"Transform the way you play with the ASUS ROG Strix Evolve optical gaming mouse. This Aura-Sync enabled mouse features swappable top covers for four different height profiles while the advanced optical sensor ensures fast and accurate tracking for precision gameplay. Built with 50-million-click Omron switches, it is designed for long-lasting durability."},{"Id":"32X43","BrandId":3,"BrandName":"Asus","Timer":"AAAAAAAAhbc=","ProductName":"Asus WT425","GraphicName":"Asus WT425.png","CostPrice":14.9900,"MSRP":37.8000,"QtyOnHand":6,"QtyOnBackOrder":0,"Description":"The button sound is only 35-40 decibels, and it does not disturb sleep of other people during office hours. Optical tracking technology with resolutions up to 1600 DPI. With a daily click of 3,000 times, the service life can reach nearly 3 years and it is durable. Superior power management features, the same battery life is more durable. Ergonomic and comfortable touch layer, so you can use it for a long time without difficulty and easy to hold."},{"Id":"32X44","BrandId":3,"BrandName":"Asus","Timer":"AAAAAAAAhbg=","ProductName":"TUF GAMING M5","GraphicName":"Asus TUF GAMING M5.png","CostPrice":26.9900,"MSRP":59.9900,"QtyOnHand":9,"QtyOnBackOrder":0,"Description":"ASUS TUF Gaming M5 ambidextrous ergonomic RGB gaming mouse with gaming-grade optical sensor, durable coating, heavy-duty Omron switches and Aura Sync lighting Ambidextrous, ergonomic and lightweight for comfortable high-speed maneuvering using claw or fingertip grip Gaming-grade 6200-dpi optical sensor for pixel-precise tracking, plus a DPI button for on-the-fly sensitivity adjustments Validated for tough duty with a specialized coating for added durability, 50-million-click Omron switches, and Teflon feet built for up to 250km of use"},{"Id":"32X45","BrandId":3,"BrandName":"Asus","Timer":"AAAAAAAAhbk=","ProductName":"GX850","GraphicName":"Asus GX850.png","CostPrice":32.9900,"MSRP":64.9900,"QtyOnHand":20,"QtyOnBackOrder":13,"Description":"A perfect harmony of performance, functioning, and ergonomics, the ASUS GX850 laser mouse gives gamers unfair advantage to dominate every competition. Precision laser technology up to 5000dpi ensures pinpoint cursor tracking, with adjustable DPI switch between 1250, 2000, 3500, 4500, or 5000 dpi for specific gaming needs. Customize functions, macros, and settings for up to 25 profiles for different gaming scenarios. Extended gaming sessions are more comfortable thanks to its ergonomic design and non-slip rubber finish."}]
